[{"id": "5863", "title": "Toxic Chemical Spill Leads to Health Concerns", "excerpt": "Article covering recent derailings by Rob Mullins.", "content": "<hr>\r\n<p>A freight train loaded with toxic chemicals derailed in Ohio last week, near the state line with Pennsylvania. The chemicals, which included vinyl chloride among others, were burned, releasing potentially toxic fumes into the air. Before that decision was made, however, enough chemicals had leaked into the ground for the EPA to send a legal notice to the rail operator, Norfolk Southern citing concerns over environmental contamination.</p>\r\n<p>Despite this, regulators have repeatedly told residents of East Palestine, Ohio, that they are safe to return to their homes. Information from state and federal regulators have been rife with contradictions, sowing distrust among locals. One resident told The Guardian that the town informed citizens municipal water was safe to drink, then advised purchasing bottled water. That is to say nothing of residents complaining of rashes after showering.</p>\r\n<p>Residents were also left confused when after being assured of their town’s safety, Norfolk Southern offered individual payments of $1,000 to assist evacuation efforts. These payouts have been met with skepticism by legal counsel for some of the residents, noting that the purported “inconvenience fee” might be an effort to force residents to waive future claims against the company.</p>\r\n<p>Ohio Governor Mike DeWine did not end the parade of contradictions after reporting on February 14 that President Joe Biden had offered federal disaster relief assistance, which DeWine reportedly declined. Two days later, DeWine said in a statement that he had requested more aid, but was informed that the city was not eligible for FEMA assistance. Locals report dissatisfaction with the way DeWine has handled the situation, describing his guidance as “not real reassuring,” according to one NPR interview.</p>\r\n<p>Not all rail cars were carrying toxic chemicals. As a result, Norfolk Southern was not subject to a law that would ordinarily have required the firm to notify Ohio state officials about the train’s contents. The governor’s office has condemned this regulation and called on Congress to amend it.</p>\r\n", "thumbnail_url": "https://th.bing.com/th/id/OIF.khdSnSDk0wSks939rjAAqw?pid=ImgDet&rs=1", "times": 42}, {"id": "8179", "title": "US Shoots Down Unknown High Altitude Object Over Alaska", "excerpt": "Coverage of the recent event in which the USA shot down an unknown object flying over Alaksa. By Joshua Lino", "content": "<hr>\r\n<p>The United States military has recently reported that it has shot down an unknown &quot;high-altitude object&quot; over Alaska. The incident occurred on the evening of February 10, 2023, and has generated a significant amount of speculation and concern among both military experts and the general public.</p>\r\n<p>At this time, details about the object are limited, and the military has not released any official statement or explanation about what it was or why it was shot down. The object was reportedly flying at a high altitude over the Alaskan wilderness, and the military claims that it posed a potential threat to national security.</p>\r\n<p>The incident has sparked widespread rumors and speculation, with some experts speculating that the object could have been an experimental military aircraft or even a UFO. However, these theories have not been substantiated by any official sources.</p>\r\n<p>Regardless of what the object was, the incident has raised serious questions about the current state of military readiness and national security. The United States has always been at the forefront of technological advancement, and the recent incident highlights the importance of maintaining a strong and capable military to protect the nation against any potential threats.</p>\r\n<p>The shooting down of the unknown object has also generated a great deal of public concern, with many people expressing concern about the potential for military escalation and even conflict. The incident has put a spotlight on the need for greater transparency and communication between the military and the public, particularly in times of heightened tension and uncertainty.</p>\r\n<p>At this time, it is unclear what the future implications of this incident will be, and what impact it will have on the United States and the world at large. However, it is clear that the shooting down of the unknown object over Alaska will continue to be a major topic of discussion and speculation in the days and weeks to come.</p>\r\n", "thumbnail_url": "https://th.bing.com/th/id/OIF.tALHMRQcGJDNeMvftsOBCQ?pid=ImgDet&rs=1", "times": 42}, {"id": "1973", "title": "State of the Union 2023", "excerpt": "Coverage of the recent state of the union address by Biden. Article by Joshua Lino", "content": "<hr>\r\n<p>President Joe Biden has recently delivered his State of the Union address to a joint session of Congress. In the speech he laid out his priorities and visions for his future administration. Biden recognized the progress America has made since the COVID pandemic, and acknowledged the strength and resilience of the American people through it. The President also acknowledged, and advocated for the aid of those who were affected negatively by the pandemic such as small business owners. Biden supplied a basic outline for raising the minimum wage and expanding job opportunity equitably. He addressed the need for social justice and an end to discrimination as well. </p>\r\n<p>Biden also touched on the importance of working with the United States allies in combating terrorism, and global concerns including global warming.</p>\r\n<p>However, ultimately the speech missed key opportunities to touch on issues that are more important in the lives of the people of America.</p>\r\n<p>The President provided no outline or timeline on how to achieve his ambitious goals.</p>\r\n<p>Biden failed to address the rising debt which is soon to cause an economic collapse if the debt ceiling is not raised, and his ambitious high spending policies are sure to not help the issue.</p>\r\n<p>Biden failed to touch on important, pressing issues such as immigration, foreign policy, and national security, only briefly mentioning the crisis at the border.</p>\r\n<p>Some on the right have critiqued it for it&#39;s partisan nature, ultimately failing to incorporate a broader national interest, and focusing only on Democratic Party positions.</p>\r\n", "thumbnail_url": "https://th.bing.com/th/id/OIP.AvRYoH7Us5l9yHMd3PeHQAHaE8?pid=ImgDet&rs=1", "times": 49}, {"id": "8435", "title": "Trump Accuses DeSantis Of Disloyalty", "excerpt": "This article covers the infighting between Donald Trump & Ron DeSantis. Article by Joshua Lino.", "content": "<hr>\r\n<p>Former President Donald Trump has recently accused Florida Governor Ron DeSantis of &quot;disloyalty&quot; following the Governor&#39;s criticism of the former President&#39;s decision to challenge the 2020 election results. This accusation has led to a rift between the two Republican leaders and sparked a debate within the party about loyalty and the direction of the party.</p>\r\n<p>DeSantis, who is considered a rising star in the Republican party and a close ally of Trump, made comments in a recent interview that criticized the former President&#39;s continued efforts to challenge the election results. DeSantis stated that while he supports Trump&#39;s right to pursue legal challenges, it was time for the party to move on and focus on the future.</p>\r\n<p>In response, Trump issued a statement in which he accused DeSantis of being disloyal and called on his supporters to &quot;find candidates who will be loyal to our movement.&quot; </p>\r\n<p>This public disagreement between two prominent figures in the Republican party has caused a rift within the party, with many leaders and activists taking sides. Those who support Trump argue that he remains the heart and soul of the party and that any attempt to move on from dear leader is a betrayal. On the other hand, those who support DeSantis argue that the party needs to look to the future and focus on winning elections, rather than dwelling on the past.</p>\r\n<p>The accusations of disloyalty from Trump towards DeSantis have also brought to light a larger issue within the Republican party, which is struggling to navigate the post-Trump era. The former President remains a powerful and influential figure within the party, and many Republicans are reluctant to openly criticize him or move away from his populist agenda. However, as the party looks to the future and tries to win back the support of voters, it will need to find a way to reconcile its competing factions and chart a new course.</p>\r\n<p>It&#39;s worth noting that Trump has a history of attacking those Republicans who don&#39;t align with him and has been known to call out those who he sees as disloyal to him. The Republican party is currently facing a crucial time, and it&#39;s uncertain how the party will navigate the divide between Trump loyalists and those looking for a new direction.</p>\r\n<p>Overall, the Republican infighting between Trump and DeSantis is a symptom of a deeper disorder within the party. The Republican Party is struggling to define its identity and agenda in a post-Trump era, and it is unclear how the party will reconcile its competing factions and chart a new course.</p>\r\n", "thumbnail_url": "https://th.bing.com/th/id/OIF.HovUz3qDjmu0SRvl61et4A?pid=ImgDet&rs=1", "times": 63}, {"id": "9107", "title": "Settler Violence Increases In West Bank", "excerpt": "Tensions continue to rise in Israel as Israeli citizens continue to attack Palestinians, and these hate-attacks are only rising. Article by Joshua Lino.", "content": "<hr>\r\n<p>Tensions are rising in the West Bank as reports of Israeli settlers attacking Palestinians continue to increase. These attacks, which range from physical violence to vandalism of property and destruction of crops, are causing concern among Palestinian residents and the international community.</p>\r\n<p>The Israeli settlements in the West Bank, which are home to a growing number of Jewish civilians, have long been a source of tension in the region. The settlements are considered illegal under international law and are seen as an obstacle to peace by many Palestinians. However, the settlers, who are heavily armed and often enjoy the support of the Israeli government and military, have been known to carry out violent attacks on Palestinian residents with impunity.</p>\r\n<p>In recent weeks, there have been numerous reports of settlers attacking Palestinian villages and towns across the West Bank. These attacks have included throwing stones at homes, burning crops, and even physically assaulting residents. In some cases, the settlers have been accompanied by Israeli soldiers, who have been accused of standing by and allowing the violence to continue.</p>\r\n<p>The escalation of settler violence has led to increased tensions between the Israeli government and Palestinian Authority. Palestinian leaders have called on the international community to take action to protect Palestinian residents and to hold Israel accountable for the actions of its settlers. They also called on the Israeli government to take stronger measures to protect Palestinians from settler violence, and to dismantle the settlements.</p>\r\n<p>The UN and EU have also expressed concern about the escalating violence and called on Israel to take action to protect Palestinian residents. The US President Joe Biden also called for the immediate de-escalation of violence and for the protection of human rights and the rule of law.</p>\r\n<p>The situation in the West Bank is a complex and sensitive one, with deep historical, political and religious roots. However, the continued violence and aggression by Israeli settlers towards Palestinians is unacceptable and must be condemned. It is essential that the international community takes action to protect Palestinian residents and to hold Israel accountable for the actions of its settlers. It is also important that the Israeli government takes stronger measures to protect Palestinians from settler violence and to dismantle the settlements, in order to pave the way for a just and lasting peace in the region.</p>\r\n", "thumbnail_url": "https://images.wsj.net/im-97668/?width=860&height=573", "times": 48}, {"id": "6440", "title": "Steven Crowder Feuds with Daily Wire", "excerpt": "Coverage of the recent Crowder-DW drama. Article by Rob Mullins.", "content": "<p>Steven Crowder made headlines last week when he publicly rejected contract negotiations with conservative media giant Daily Wire. The contract reportedly offered Crowder $50 million to join the network, with an important caveat. The stipulation to the sweetheart deal was that if Crowder were banned from any online platform, he would take a salary cut. This proved to be intolerable to the intrepid journalist, and he took to Twitter to express his dissatisfaction.\r\nThe Daily Wire quickly responded in video form with the company’s CEO, Jeremy Boreing, going over the contract in-depth and expressing regret that the dispute escalated so severely. This prompted Crowder to take the unprecedented move of posting negotiations made over the phone with Boreing to the internet, a move that was met with condemnation by pundits like Daily Wire’s Candace Owens, who referred to it as a “bitch move.”</p>\r\n<p>In a video discussing the controversy, Crowder took umbrage with the fact that the contract made a 25% cut to his salary if he were to be banned from any Big Tech platforms like Twitter or YouTube Daily Wire claims that it is unreasonable for Crowder to expect the same salary if Crowder’s indiscretions lead to a substantial decrease in the revenue he will bring to the network. The crux of Crowder’s complaint is that the contract essentially acts as an enforcement arm of Big Tech censorship–something Crowder and Daily Wire pundits have vocally opposed in the past. Crowder viewed the clause as cowardly and greedy, accusing the Daily Wire of being “in bed” with Big Tech.</p>\r\n<p>Consumers of conservative media appear divided, after an initial wave of sympathy for Crowder, who was perceived as standing on principle. His support cooled after a Twitter user pointed out that a website Crowder associated with his efforts to fight Daily Wire censorship was registered in December of last year. Jeremy Boering’s clarification that the contract was an initial offer to open negotiations also softened opposition to the Daily Wire. So far, no more progress has been made, and it appears that the controversy is yet another example of competing right-wing media outlets cannibalizing one another.</p>", "thumbnail_url": "https://media.discordapp.net/attachments/1048728074038030378/1066889429177864303/327028470_709394957230185_3884108899213158906_n.png?width=915&height=610", "times": 55}, {"id": "8913", "title": "More Classified Documents Found At Biden's Home", "excerpt": "A summary of the most recent Biden scandal by Joshua Lino.", "content": "<hr>\r\n<p>Yet again, another classified set of documents has been found at the Biden household, after the discovery of a first document which the White House said had been found.</p>\r\n<p>Further documents have been found in his garage as well as in his former offices at the Penn Biden Center from his time as vice president under Obama. The mishandlings of documents under the Obama administration is now under investigation by Robert Hur, appointed as special counsel this Thursday by Attorney General Garland. The mishandling of classified or even unclassified documents is considered to be a serious criminal offense.</p>\r\n<p>The White House has come under serious scrutiny and concern after taking roughly two months to comment on the incidents. All though the case is presently under investigation, it is yet to be seen whether or not obstruction of justice have been attempted, or if there are further charges that Joe Biden is worthy of being charged with.</p>\r\n", "thumbnail_url": "https://th.bing.com/th/id/OIP.nZ7keY1jtYPWXOzLv_4dYwHaEL?pid=ImgDet&rs=1", "times": 44}, {"id": "1370", "title": "Winter Storm Across North America", "excerpt": "Coverage of the winter storm ravaging North American cities. Article by Rob Mullins", "content": "<hr>\r\n<p>Winter storm Elliot ravaged New England last week, killing at least 28 in Buffalo, NY according to the Weather Channel. The winter storm delayed 10,000 flights as it strengthened into a bomb cyclone. The Weather Prediction Center referred to it as an “historic arctic outbreak.” Blizzard conditions occurred as far as Cincinnati, even though there was no blizzard warning issued there. The town of Baraga, Michigan received the most snow, totalling 42.8 in.</p>\r\n<p>Millions of people canceled Christmas celebrations as 13 states declared a state of emergency, activating the National Guard. They included Georgia, South Dakota, Colorado, Connecticut, Kansas, Kentucky, Maryland, Missouri, North Carolina, New York, Oklahoma, West Virginia, and Wisconsin. A blizzard warning was also issued for large portions of southwestern and midwestern Ontario.</p>\r\n<p>As expected, the storm caused significant travel delays, including a fifty-car pileup on the eastbound Ohio turnpike, which led to it being closed in both directions. Conditions were so dangerous that travelers caught in the storm froze in their cars. The Weather Channel reported that the storm will be remembered for its “brutal cold,” reaching -24°. In Buffalo, the hardest-hit region, it will be remembered as even deadlier than the Blizzard of 1977.</p>\r\n", "thumbnail_url": "https://s.yimg.com/ny/api/res/1.2/IoIdF9QsJDP5BqdvdE7jWw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MA--/https://media.zenfs.com/en/people_218/c0e6160956297db2e7f2824908b22cbf", "times": 36}, {"id": "5817", "title": "The Return Of Slavery In The United States? An Analysis Of The Negative Effects Of The H-2B Visa", "excerpt": "An analysis of the H-2B Visa. By Joshua Lino", "content": "<hr>\r\n<p>The Department of Homeland Security and the Department of Labor are creating a temporary rule that makes available over 60,000 H-2B temporary visas. The H-2B nonimmigrant program permits capitalists to temporarily hire nonimmigrants (foreign citizens granted work in the USA under a visa), to perform various labor and services in the United States. This dangerous program will hurt working class American citizens by actively displacing them from their workplaces. </p>\r\n<p>Capitalists have laid the claim that U.S. workers looking for long-term employment will not seek out H-2B occupations, however, depressed wages and insincere recruitment efforts make a true test of the U.S. labor market impossible. Various employers have advertised for H-2B labor jobs such as construction, with low wages, and go on to employ the workers to do trucking jobs, worth far more than what their occupational description enticed. Through this program, capitalist employers have intentionally misclassified the occupation to pay at lower wages and exploit workers, while refusing jobs for workers that qualify for the occupation.</p>\r\n<p>A common myth promoted by the government has been that hiring H-2B workers is not cheap. This is a blatant lie to perpetuate exploitation of the working class. DOL data released in 2014 showed that employers were able to save $2.59-$3.80 per hour by hiring H-2B workers, being able to pay them lower wages for labor. Overall studies show that H-2B workers are at the same wage-earnings as undocumented immigrants are in the United States.</p>\r\n<p>Studies have shown that the abuse of workers under H-2B is a systemic issue. In 2015, Indian workers employed under H-2B occupations won $14,000,000 in a lawsuit, for human trafficking and discrimination, fought, Signal International.  Worker abuse, wage theft, trafficking, and discrimination is too numerous to be able to leave H-2B unscathed as far as ethical concerns go.</p>\r\n<p>In conclusion, the results are clear, that this program is liberalism&#39;s new innovation to return slavery to the United States.</p>\r\n", "thumbnail_url": "https://th.bing.com/th/id/R.51cf00e67274bb03f33d5462de296733?rik=OGcQVJodRLk1kA&pid=ImgRaw&r=0", "times": 34}, {"id": "2651", "title": "Elon Musk Runs Poll Asking Whether Or Not To Step Down As Twitter CEO", "excerpt": "Elon Musk's poll on whether or not to step down as CEO of Twitter. By Joshua Lino", "content": "<hr>\r\n<p>Elon Musk has recently conducted a Twitter poll asking users if they believe he should step down from Twitter as CEO of the company. Musk this weekend said that he will abide by twitter poll results. The poll showed 57% of Twitter users would prefer that Elon would step down from his position as Twitter CEO. For many, his time as the owner of Twitter feels extremely short lived, and his stepping-down feels extremely premature. It could very well be that Elon is intending on stepping down now, in accordance with the poll or this could very much be part of a larger plan.</p>\r\n<p>Twitter has recently clamped down on bot accounts, banning them by the thousands, and so this poll could be a ploy to draw out bot accounts, so that Twitter may more easily find them and eliminate them by having them participate in the massive polling. However, to be completely fair, this is but a theory, and Elon may be deciding to step down from his position, regardless of whether or not this is part of a larger scheme on Twitter’s part to expose bot accounts.</p>\r\n<p>Elon Musk’s decisions as Twitter CEO have made many Tesla shareholders believe he is becoming distracted with a separate project, which have caused many investors to lose faith, and leave the deal out of fear that Elon may very well be getting sidetracked with his new favorite toy. This has had such a sweeping effect that Tesla’s stock is the worst off it has ever been since it launched off and went public in 2010.</p>", "thumbnail_url": "https://cdn.cnn.com/cnnnext/dam/assets/180907100732-elon-musk-smokes-marijuana-podcast-1-super-169.jpg", "times": 35}, {"id": "3881", "title": "The Myth of Race", "excerpt": "Dismantling various modern myths used by racial realists. By Joshua Lino", "content": "<hr>\r\n<p>There has been a myth in the life of global politics extending across the board since its founding: the notion that race is real. This toxic idea has permeated the fabric of American politics on both ends of the political spectrum. In this article we are going to cover the myth of race and its many pseudoscientific conceptions.</p>\r\n<h2 id=\"success-in-correlation-to-race\">Success in correlation to race</h2>\r\n<p>Race realists love to attempt to correlate the amount of European heritage in an African American to the amount of success they appear to have, but fail to realize the fact that correlation does not equal causation. For example the number of people in 2010 who died from tripping and falling correlates roughly 95% with the amount of people who died of drowning in natural water. But nobody would seriously suggest that if you trip and fall, you are more likely to trip and fall into water and drown to death. Again, correlation does not equal causation.</p>\r\n<h2 id=\"race-on-a-genetic-basis\">Race on a genetic basis</h2>\r\n<p>The “Worldwide Human Relationships Inferred From Genome-Wide Patterns of Variation” study, is commonly used by race realists in an attempt to say that race can be defined because there are specific genes in some groups which are either more prominent than in other circles, or not there at all in other circles. However the study authors never intended this to be used as a racialist study, and only stated that it <em>could</em> be used to determine one&#39;s ancestry. A graph which has been circulating in correlation to this study in an attempt to say that the African genome is parsed extremely far apart from the European genome, was cited nowhere on the study, and was made up by racialists in an attempt to make differences seem extremely visually prominent. This commonly used study even states that the study does nothing to comment on the origins of phenotypic variations. In fact it states from it’s findings that most diverse gene groups in the human race tend to be the very ethnic groups which race realists love to claim to be so pure and homogenous. In other words, when you get a sub-saharan group, and a swedish group, and put them in a room together, there will on average be more diversity within the sub-saharan african groups and the swedish groups, than there is <em>between</em> these two separate groups.</p>\r\n<p>DNA tests give you information on where your ancestors came from. However, that&#39;s not the same as telling you what your race is. Various adaptations of people based on environments caused them to develop various different adaptations to aid them in survival, and this is what makes certain traits traceable. It doesn’t at all entice that there are various human subgroups. Human subgroups that have attempted to be constructed such as the notions of race, and ethnicity, are divisible however many times you want to divide the categories, by whatever standard you wish to divide them. You can in fact find different ethnic groups within ethnic groups depending on how much you wish to magnify said differences and by which standard. The visual graph mentioned in the previous paragraph spaces apart the races mentioned into 5 groups, however with this previous information in mind, why not parse apart said “races” into 1000, maybe 2000 different ethnic groups. Out of the 1,000,000 genetic differences within the human race, only 70 genes have undergone population-based variations. These ones are relegated to medical-related variations as in tolerance for certain foods, the prevalence of rare and unlikely disorders, and pigmentation, etc etc.</p>\r\n<p>Race realists usually point to various characteristics such as sickle cell anemia, as proof that some genes are race-based. The truth however, is that sickle cell is an adaptation in areas with high rates of malaria, correlated in no way to race. You find it in some areas of Africa, Asia and Europe, at higher and lower rates than in other environments.</p>\r\n<h2 id=\"race-and-iq\">Race and IQ</h2>\r\n<p>We find that IQ seems at first to have massive disparities between racial groups, and this may at first seem to be an appealing argument, however when you look ultimately at the environment, things begin to make much more sense. Africa is the second most volatile continent on the planet when it comes to weather and climate. African civilizations had very little chance to develop with those conditions, unlike in Europe in which groups were forced to band together to survive winters, though as well having times of year majoritively which permitted good conditions for agriculture, these conditions don’t exist in much of Africa despite Africa’s abundance in resources which are unable to be tapped into. Within the last 300 years we have seen the average african-descent IQ vary up to 30 points on average depending on region, which is far past the allowed standard deviation, proving that the IQ of african-american communities, and global communities as a whole, are far more based on environment than on genetics. These ranges go as low as 63 in nations such as Ethiopia, to an average of 96 in such cases as in those raised in education in the DoDEA, only another standard deviation away from the highest average Asian IQ, and half of that away from the average white Americans. This disproves that Africans have a high IQ disparity by nature, leaving no room for this fallacious theory. What is more is that this IQ gap, as education has improved, has shrunk greatly since the 80s until now.</p>\r\n<h2 id=\"systemic-discrimination\">Systemic discrimination</h2>\r\n<p>Other issues originate from within systems, such as the generational effects of redlining against African-American communities, causing generational poverty, thus underfunding of taxes into African-American dominated school systems due to that poverty, lack of education therein, and the need of crime to bring in alternative income into their communities, thus normalizing violence within many aspects of African-American culture. These system-related issues still affect African-American populations in the USA to this day and is the reason why crime rates are so high within those communities. This problem is only worsened by the vast majority of black characters in media being primarily portrayed as gangsters or sports-stars, and the lack of diversity in the media, intentionally so, of African-American citizens.</p>\r\n<h2 id=\"conclusion\">Conclusion</h2>\r\n<p>Some issues are not covered here, however, the only thing we can truly find concretely is that there are region-based differences within human populations which show some closer genetic similarities between certain regional demographics than to other ones, however there is no basis for a remotely clear line between these groups on a logical level. People do look different, however ultimately there is no scientific basis to support the notion of race or ethnicity within the scientific community.</p>", "thumbnail_url": "http://2.bp.blogspot.com/-LtGF1mDe7Ok/TrfVsSpz9RI/AAAAAAAAADw/nlzYwn-41l0/s320/Skulls-+by+race.jpg", "times": 65}, {"id": "2727", "title": "Volodymyr Zelensky Moves To Ban the Ukranian Orthodox Church", "excerpt": "Ukraine's president has called to ban the Ukranian Orthodox Church amid war. By Rob Mullins", "content": "<hr>\r\n<p>Ukrainian President and prolific war hawk Volodimir Zelensky has begun a full-scale effort to strengthen the legitimacy of his embattled regime by targeting the Ukrainian Orthodox Church. Zelensky used strong pro-Russian sentiment expressed by Russian Orthodox Patriarch Kirill, deeming the Orthodox Church to be a hotbed of treasonous sentiment and ordered several Orthodox priests arrested. </p>\r\n<p>Ukraine’s security service, the SBU, claims that 33 Orthodox priests have been arrested for gathering intelligence or otherwise assisting the Russian regime. President Zelensky has reportedly asked Ukrainian MPs to pass legislation that would “make it impossible for religious organizations affiliated with centers of influence in the Russian Federation to operate in Ukraine,” according to Emerging Europe. These comments led Russian PM Dmitry Medvedev to characterize the Ukrainian regime as “enemies of Christ and the Orthodox faith.”</p>\r\n<p>The crackdown has led to other changes, such as the date of Christmas itself. By custom, Ukrainians celebrate Christmas on Jan. 7, the date of Christ’s birth on the Julian calendar. Now, the Kyiv-loyal Orthodox Church or Ukraine is allowing its faithful to celebrate on Dec. 25, in accordance with the Gregorian calendar, all in an effort to increase distance from and tension with Russia. What better way to celebrate peace on earth and good will among men?</p>\r\n", "thumbnail_url": "https://th.bing.com/th/id/OIF.XXw58TmJFCKrWoms55DrTg?pid=ImgDet&rs=1t&rs=1", "times": 28}, {"id": "2674", "title": "A Summary of the Balenciaga Scandal", "excerpt": "A recent controversy has popped up surrounding the fashion brand \"Balenciaga\" within the last week. Editor Rob Mullins covers a concise overview of the story.", "content": "<hr>\r\n<p>Balenciaga came under fire last week for releasing a controversial holiday ad campaign that depicted children in ways widely perceived as inappropriate. The ads in question featured children holding teddy bears clad in bondage gear. Critics of the first photos to emerge from the campaign were later incensed to discover that they also contained a veiled reference to child pornography.</p>\r\n<p>Twitter user Shoe0nhead first posted the pictures that led contained an excerpt from a 2008 Supreme Court ruling regarding child pornography, U.S. v Wiliams. The quote depicted comes from the late Antonin Scalia on behalf of the majority, who wrote, “Sexually explicit conduct&#39; connotes actual depiction of the sex act rather than merely the suggestion that it is occurring. And &#39;simulated&#39; sexual intercourse is not sexual intercourse that is merely suggested, but rather sexual intercourse that is explicitly portrayed, even though (through camera tricks or otherwise) it may not actually have occurred.&quot;</p>\r\n<p>The backlash was swift and intense, leading Balenciaga and associated brands to end their social media presence. As of writing, Balenciaga has no posts on Instagram. The fashion house has even been condemned by Kim Kardashian, who used to do shoots with the brand, citing concern for her children. The brand has also had its defenders, including notoriously stable genius “Ye” West. Critics continue to parse the photos for inappropriate symbolism, and as they continue to find examples in abundance, it appears the controversy will not die down anytime soon.</p>\r\n", "thumbnail_url": "https://netrinoimages.s3.eu-west-2.amazonaws.com/2016/12/18/431639/256729/balenciaga_logo_3d_model_c4d_max_obj_fbx_ma_lwo_3ds_3dm_stl_2696759_o.jpg", "times": 14}, {"id": "6430", "title": "The Consequences for Oregon of Passing Measure 114", "excerpt": "Measure 114, a dangerous new bill attempting to find its way into legislation, may be the end of firearm freedoms in Oregon. Article by Joshua Lino.", "content": "<hr>\r\n<p>Oregon’s measure 114 is a recent firearm policy that is being attempted to be put into action in the state of Oregon by anti-gun billionaires: Connie Ballmer, Nicolas Hanauer, and Michael Bloomberg. This law very much resembles California’s, and many other “blue” state firearm policies. Measure 114 requires a permit from law enforcement directly for people to purchase them. The police force in Oregon is one of the worst in the nation, being grossly underfunded for training as well as their facilities abroad, and vastly understated in comparison with the majority of the USA. This measure would require application for a “safety training course”, of which there are virtually no safety training facilities to be able to participate in within the state of Oregon. It would require the police force 40,000,000 dollars annually to succeed in delivering the required training. Measure 114 as well, requires a criminal background check, and restrictions on magazines capable of holding more than 10 rounds of ammunition.</p>\r\n<p>The State of Oregon has undergone massive scrutiny from many of its citizens, so much so that it is now being sued over possible violations of the constitution of the USA. It will be decided by the Secretary of State by the 8th of December, if the legal passing of this legislation is to be delayed or not. Representation of the 2nd amendment of the American Constitution (the right to bear and keep arms) and Oregon’s own Art. I, sec. 27 clause, stating that the people shall have the right to bear arms for the defense of themselves, and the State, but the Military shall be kept in strict subordination to the civil power, will be more than enough to defeat these unjust attempts at legislation.</p>\r\n<p>Portland media is attempting to state that these new restrictions are simply about developing more sufficient background checks. This is a blatant lie. The state of Oregon has had background checks for a very long time. This bill is about much more than simply legislating better and more efficient background checks. This bill is about controlling the citizens of Oregon and forcing the submission of the people of Oregon to an insufficient state of government which has been shown time and time again to repeatedly be the core of the issue plaguing Oregon’s streets. What Oregon’s government wants now is to be able to strip the citizens of their ability to defend themselves, and to relegate their population to downgraded weaponry, which will never be able to defend itself against any inevitably imposed tyranny.</p>\r\n<p>This law, if passed, would leave the poor, the rural, and those in dangerous, perhaps even fatal circumstances, virtually defenseless to protect themselves and their family. There is no possible way that the underfunded Oregonian police would be able to balance these facilities, if they did exist, on their already dwindling and tiring budgets. All we, as fellow Americans, can do, is hope that this legislation will be delayed for now at the very least, and at the very most, that this unlawful and dangerous bill will never see its place in legislation.</p>", "thumbnail_url": "https://preview.redd.it/3etmpddtsa851.jpg?width=960&crop=smart&auto=webp&s=394fa63b23418ef0eb90152b8846f86aee50c2ca", "times": 20}, {"id": "2879", "title": "GOP “Unexpectedly” Underperforms in Midterms", "excerpt": "An examination of the 2022 midterms, by Rob Mullins", "content": "<hr>\r\n<p>The 2022 midterm elections have proven to be largely disappointing for Republicans, following weeks of predictions of a “red wave” sweeping the country. In an election cycle with a historically unpopular president and record-high inflation, only the GOP could bungle things this badly, because they can’t win for losing. </p>\r\n<p>Divisive candidates, misallocated resources, party division, and lack of a coherent message have squandered what easily should have been a slam dunk for the American right wing. In 2010, halfway into Barack Obama’s first term, his approval rating was almost ten points higher than Joe Biden’s, roughly 49% to 40% respectively. In that year, Republicans gained 63 seats in the House of Representatives, and seven in the Senate.</p>\r\n<p>The nascent right-wing polling firm Trafalgar had an abysmal night made all the more painful after distinguishing itself as the most accurate indicator of Donald Trump’s support in 2016 and 2020. The firm overestimated Republican support in Senate races by an average of 7.5%, according to The Intelligencer. </p>\r\n<p>Mitch McConnell surely did all he could to lower expectations–referring to the Senate as “just different” than House races when he was asked if he expected to begin the new congress as majority leader. McConnel cited candidate quality as the reason for his reticence, which would turn out to be a prescient concern, aggravated by the inability of inexperienced candidates to fundraise effectively.</p>\r\n<p>Problems with fundraising appear systemic among Republican candidates for federal office. Democratic candidates outraised Republican opponents by an average of 2-to-1 according to campaign finance analysis by the Associated Press. In a few rare cases, the disparity was not insurmountable, as JD Vance, who won the Ohio Senate race by 6 percentage points, was outspent nearly 4-to-1 by his opponent Tim Ryan. Vance was given a boost by the Senate Leadership Fund, a super PAC strongly aligned with Mitch McConnell.</p>\r\n<p>Complicating McConnell’s efforts to intervene in vulnerable races was the National Republican Senatorial Committee, led by Florida Senator Rick Scott. The two operations operated largely independent of one another, and were worse off as a result. McConnell mobilized early in an effort to fend off unsavory candidates who were viewed as unlikely to win, like New Hampshire’s Don Bolduc.</p>\r\n<p>This effort clearly failed, judging by how many Trump endorsees won GOP primaries, like Mehmet Oz in Pennsylvania and Blake Masters in Arizona. The party grassroots do not stand by Mitch McConnell Republicans, that’s obvious. But this alone will not propel right-wing candidates to victory. Senator Scott’s leadership of the NRSC has proven problematic, with a significant amount of money ending up in the hands of consultants with little results to show from it.</p>\r\n<p>It is clear the Republican Party needs to chart a new course. It needs to field candidates with the will and energy to win. It needs to improve fundraising abilities, and disperse funds to vulnerable candidates. What is clear is that it’s no longer viable to throw institutional McConnell money behind faux centrist candidates who will always lose. There needs to be a synthesis between the populists, backed by Scott and Trump, for whom GOP voters have demonstrated strong support, with financial backing by party leaders like McConnell. If party leaders fail to realize this vision, they will look back at the 2022 midterms with nostalgia as they continue to lose both seats in Congress and the support of the nation.</p>\r\n", "thumbnail_url": "https://www.campussafetymagazine.com/wp-content/uploads/2018/11/iStock-884243522-1000x500.jpg", "times": 15}, {"id": "6791", "title": "Trump Launches 2024 Presidential Campaign", "excerpt": "A concise summary of Trump's 2024 campaign, by Rob Mullins", "content": "<hr>\r\n<p>After losing the popular vote in 2016, losing re-election in 2020, and costing the GOP the Senate majority and several tossup House seats, Donald Trump did the most rational thing in light of this track record: he began his campaign for president in 2024. He announced on November 15th, after a lackluster performance by congressional Republicans in the midterm elections nationwide. </p>\r\n<p>The somewhat muted tone and restrained rhetoric drew mixed reactions from fans and detractors alike. Politico reported that this is an indication that the former president is “no longer having fun.” The low-energy announcement and the failure of hand-picked candidates like Kari Lake and Blake Masters have shaken the GOP’s faith in Trump as leader and kingmaker–and rightfully so.</p>\r\n<p>Trump’s precipitous fall from grace came astonishingly quick. Voter enthusiasm for his third presidential run has not materialized. Even Republican officials are shocked at the lack of engagement. “The excitement’s just not there,” Saul Anuzis, former chair of the Michigan Republican Party, told Politico. </p>\r\n<p>Although several politicians have expressed an interest in the Republican nomination, right now the only serious threat to Trump comes from Florida governor Ron DeSantis. According to a poll released in November by the conservative pollster Club for Growth, DeSantis leads Trump in a hypothetical primary matchup in the states of Iowa, New Hampshire, Georgia, and Florida.</p>\r\n<p>The numbers in Florida are stark, where DeSantis leads Trump 56% to 30%, according to US News &amp; World Report. DeSantis’s lead hardly shrinks outside his home state; he leads Trump 55% to 35% in Georgia, and 52% to 37% in New Hampshire. If Trump still retained any competent advisors, and it is very unlikely that he does, these results would set off alarm bells.</p>\r\n<p>The Republican Party made much-needed inroads with blue collar Midwestern voters, white women, and Hispanics under Trump’s leadership in 2016. Since that singular win, the GOP has largely languished under the continuing burdens that Trump’s lack of focus has forced on them. Sadly, because the party is now dominated by spineless, out-of-touch sycophants, it does not appear capable of changing course, even with a much more vibrant, virile, and competent potential successor waiting in the wings.</p>\r\n<p>It is apparent that the Republican Party has lost confidence in Donald Trump, a convenient sentiment to emerge after he achieved total control of the party apparatus. This was no cause for complaint when Trump was at the helm and Republicans are winning, but this is clearly no longer the case.</p>\r\n<p>The majority of Trump’s endorsed candidates lost in the midterms. Ann Coulter noted that if Herschel Walker loses, which appears increasingly likely as Georgia’s senate race enters a runoff, it would be the third successive time Trump has caused the loss of what should be an easy GOP pickup in the state.</p>\r\n<p>It’s not as simple as the GOP abandoning Trump either. Without him, the Party will find itself in the same situation it was in 2015 before Trump took over: a party of out-of-touch consultants and figureheads with no political program other than lowering the marginal corporate tax rate. So while it may be easy to blame upcoming Republican losses on Trump, it is important to remember that the Party’s leadership is just as much to blame, and these losses will continue until both Trump and the leadership are replaced.</p>\r\n<hr>\r\n<p>Sources:</p>\r\n<hr>\r\n<p><a href=\"https://www.politico.com/news/magazine/2022/11/17/trump-2022-not-enjoying-himself-00069339\">https://www.politico.com/news/magazine/2022/11/17/trump-2022-not-enjoying-himself-00069339</a>\r\n<a href=\"https://www.politico.com/news/2022/11/27/republicans-against-trump-2024-00070632\">https://www.politico.com/news/2022/11/27/republicans-against-trump-2024-00070632</a>\r\n<a href=\"https://www.usnews.com/news/politics/articles/2022-11-14/desantis-beats-trump-in-hypothetical-primary-matchups-poll\">https://www.usnews.com/news/politics/articles/2022-11-14/desantis-beats-trump-in-hypothetical-primary-matchups-poll</a></p>", "thumbnail_url": "https://media.wired.com/photos/5fa5c014d683a4ea1e288713/master/w_2560%2Cc_limit/Culture_trump_socialmedia_1229490572.jpg", "times": 15}, {"id": "2413", "title": "Donald Trump’s Possible Political Fallout After Hosting White Nationalist, Nick Fuentes. Why This Is Important, And What It Means For His Political Future.", "excerpt": "Kanye does it again, but this time the fate of America is at stake. Trump claims non-affiliation. Where does this leave 2024?", "content": "<hr>\r\n<p>Former president, Donald J. Trump, has faced harsh criticism in light of the recent hosting of white nationalist and catholic theocrat, Nick Fuentes. Nick Fuentes was brought as a guest by Kanye West, who has recently undergone heavy media scrutiny after stating that he was going to go “Defcon-3 on the jews.” It’s very likely that West orchestrated this meeting so that Trump would be forced into an awkward situation. West also invited Trump to become his vice president in the recent 2024 presidential race.</p>\r\n<p>After saying that Trump did not know of Fuentes prior to the Mar-a-Lago, but as reported by Kanye, that he was impressed by the young man&#39;s conduct, Trump underwent massive media scrutiny, at which point his vice president for his running race in 2024, Mike Pence called out for Mr Trump to denounce Nick Fuentes, saying “Trump was wrong to give a white nationalist, an antisemite and a Holocaust denier a seat at the table. I think he should apologize for it. I think the president displayed profoundly poor judgment in giving those individuals a seat at the table.” Milo Yiannapolous came out, no pun intended, stating that he was the architect of the entire plan.</p>\r\n<p>But what does this really mean for the republican party? Since the recent split in the GOP between Donald Trump and Ron DeSantis, this creates a further schism, and has caused massive damage in Trump’s popularity among the majority of his working class supporters, and has massively attracted far right wing, and overall authoritarian groups, and is likely the first step in a closer bridging between the far-right wing of the USA, and the traditional standard conservative movements. This meeting and it’s implications of Trump’s reputation may have massive repercussions for his ability to succeed in winning the presidential election of 2024, and may jeopardize his ability to win against Ron DeSantis, the present Florida governor formally endorsed by Donald Trump, who has recently committed a sort of political mutiny against the old president, in pursuing his own presidential career.</p>\r\n<p>Whether or not Donald Trump was aware of who Nick Fuentes was, is irrelevant at this point, as the damage has been done. He knows who he is now, and has a political obligation to clarify his relationship with the influencer, if he hopes to be able to save his own career in running in 2024. Overall, Donald Trump has exhibited an awful lack of judgment in this scenario, and some may argue that this very much has proven to make him an untenable candidate for presidency.</p>\r\n", "thumbnail_url": "https://d.newsweek.com/en/full/2155573/comp-photo-donald-trump-nick-fuentes.jpg", "times": 14}, {"id": "3560", "title": "ABOUT", "excerpt": "About the People's American Press.", "content": "<p>The People&#39;s Press of America is a media site designed by working class American citizens to provide quick and easily digestable material, as well as extra political commentary, in a weekly released paper covering geopolitical events.</p>\r\n<p>We aim to publish the truth, the absolute truth and nothing but the truth. We reject the present agendas of internationalism, liberalism, individualism and capitalism, and thus in commentary we do not cater to these toxic and destructive viewpoints that other organizations have chosen to cater to for the sake of their own personal convinience.</p>\r\n<p>We aim to spread accurate news, as well as to spread the message of American patriotism, socialism, state-secularism, as well as cohesive unity of the American proletariat.</p>\r\n<p>&quot;ɪɴ ᴛʜᴇ ᴍᴏᴜᴛʜꜱ ᴏꜰ ᴛʜᴇꜱᴇ ꜱᴏ-ᴄᴀʟʟᴇᴅ ʀᴇᴘʀᴇꜱᴇɴᴛᴀᴛɪᴠᴇꜱ ᴏꜰ ᴛʜᴇ ᴘʀᴏʟᴇᴛᴀʀɪᴀᴛ, ᴀʟʟ ꜱᴏᴄɪᴀʟɪꜱᴛ ꜰᴏʀᴍᴜʟᴀꜱ ʟᴏꜱᴇ ᴛʜᴇɪʀ ʀᴇᴀʟ ᴍᴇᴀɴɪɴɢ. ᴛʜᴇ ᴄʟᴀꜱꜱ ꜱᴛʀᴜɢɢʟᴇ ᴀʟᴡᴀʏꜱ ʀᴇᴍᴀɪɴꜱ ᴛʜᴇ ɢʀᴇᴀᴛ ᴘʀɪɴᴄɪᴘʟᴇ; ʙᴜᴛ ɪᴛ ᴍᴜꜱᴛ ʙᴇ ꜱᴜʙᴏʀᴅɪɴᴀᴛᴇᴅ ᴛᴏ ɴᴀᴛɪᴏɴᴀʟ ꜱᴏʟɪᴅᴀʀɪᴛʏ.&quot;</p>\r\n<p>- Gᴇᴏʀɢᴇꜱ Sᴏʀᴇʟ.</p>\r\n", "thumbnail_url": "https://media.discordapp.net/attachments/1031020496118095903/1044487704588587059/unknown.png", "times": 129}]